Repository: lenoryv/collective.spanishdocumentation
Catalog: installing-plone/installing-plone-level1.tmx
Source language: en_us
Languages: es_ve

source: lxml, a Python wrapper for libxml2 and libxslt, is not required for Plone 4.1.
es_ve: lxml, un wrapper (empaquetador) de Python para libxml2 y libxslt, no es requerido para Plone 4.1.

source: But it is needed by some popular addons like plone.app.theming.
es_ve: Pero se necesita por algunos programas populares adicionales como plone.app.theming.

source: Unless you specify this flag, the installer will try to build lxml with static libxml2 and libxslt libraries.
es_ve: A menos que usted especifique esta opción, el instalador tratará de construir lxml con las librerías estáticas libxml2 y libxslt.

source: This may not work on all platforms.
es_ve: Puede que esto no funcione en todas las plataformas.

source: Skip running bin/buildout.
es_ve: Saltar la ejecución de bin/buildout.

source: You should know what you're doing.
es_ve: Usted debería saber que está haciendo.

source: The main use for this option is if you want to use the Unified Installer to put all the pieces together, then plug in your own buildout.cfg.
es_ve: El uso principal para esta opción se refiere a cuando usted desea que el instalador Unificado junte todas las piezas, para luego activar su propio buildout.cfg.

source: The Unified Installer will try and figure out whether or not you have the libz, libjpeg and readline libraries on your system.
es_ve: El instalador Unificado averiguará si usted tiene o no, las librerías libz, libjpeg y readline en su sistema.

source: If you do, great; if not, the installer will try to build them in the lib/ subdirectory of your installation target and link to them directly.
es_ve: Si las tiene: genial. Si no las tiene, el instalador tratará de construirlas en el subdirectorio lib/ del destino de su instalador y hacer un enlace directamente a ellas.

source: This may not be what you want.
es_ve: En el caso de que esto no sea lo que quiere,

source: If not, use the following command-line options to tune the behavior.
es_ve: use las siguientes opciones de líneas de comando para ajustar este comportamiento.

source: to have this program determine whether or not you need the library installed.
es_ve: Tener este programa determina si necesita o no la librería instalada.

source: If needed, will be installed to $PLONE_HOME.
es_ve: Si es necesaria, será instalada en $PLONE_HOME.

source: This is the default behavior.
es_ve: Esta es el comportamiento por defecto.

source: to force install to $PLONE_HOME (or $LOCAL_HOME) for static link -- even if a system copy of the library is available.
es_ve: para forzar la instalación en $PLONE_HOME (o $LOCAL_HOME) para enlaces estáticos, incluso si una copia en el sistema de la librería está disponible.

source: to force no installation of the library.
es_ve: para no forzar la instalación de la librería.

source: Ubuntu / Debian Package Installation
es_ve: Paquetes de instalación Ubuntu / Debian

source: How to install required packages on Debian/Ubuntu style systems.
es_ve: ¿Cómo instalar los paquetes requeridos en los estilos de sistemas Debian/Ubuntu?

source: Before installing you may install the needed system packages by running:
es_ve: Antes de comenzar el proceso debería instalar los paquetes del sistema requeridos para la ejecución:

source: It's also very desirable to use system packages for common libraries, rather than to have the installer use its own:
es_ve: En vez de permitir al instalador usar su propios paquetes, es muy conveniente usar los paquetes del sistema para librerías comunes.

source: And, if you want to enable Word and PDF document indexing:
es_ve: Y si usted quiere habilitar la anexión de documentos de Word y PDF:

source: Platform Notes
es_ve: Notas de Plataformas

source: User-contributed notes on using the Unified Installer on particular platforms
es_ve: Notas de contribución de usuarios que usan el instalador Unificado en plataformas particulares

source: Install on Solaris 10 (x86)
es_ve: Instalando en Solaris 10 (x86)

source: Posted by Michael Bobzin at Feb 15, 2008 03:12 PM
es_ve: Publicado por Michael Bobzin el 15 de Febrero de 2008 03:12 PM

source: Hi,
es_ve: Hola,

source: for getting the installation done on Solaris 10 (x86) I had to
es_ve: para completar la instalación en Solaris 10 (x86) tengo que

source: change some lines in install.sh
es_ve: cambiar algunas líneas en install.sh

source: nstalling on Solaris 10 (SPARC)
es_ve: Instalando en Solaris 10 (SPARC)

source: Posted by Joni Barnoff at Apr 05, 2008 07:31 PM
es_ve: Publicado por Joni Barnoff el 5 de abril de 2008 07:31 PM

source: This is needed to include libssl in python build
es_ve: Esto es necesario para incluir libssl en la construcción de Python.

source: Installing on Solaris 10 (SPARC)
es_ve: Instalando en Solaris 10 (SPARC)

source: Posted by Jim Leek at Mar 20, 2009 04:21 PM
es_ve: Publicado por Jim Leek el 20 de Marzo de 2009 04:21 PM

source: The main issues on Solaris are due to the fact that the installer script (install.sh) cannot always get the correct paths for the correct versions of software on Solaris.
es_ve: Los inconvenientes principales en Solaris se deben al hecho de que el script del instalador (install.sh) no siempre puede obtener las rutas correctas para la versión correcta del software en Solaris.

source: It also has problems finding the correct libraries in the Solaris environment.
es_ve: También tiene problemas para encontrar las librerías correctas en el entorno de Solaris.

source: To add to this install.sh uses the basic Bourne shell (#!/bin/sh), which means that some of the commands which are part of the Linux Bourne shell and which are not present in the Solaris Bourne shell just do not work.
es_ve: Para agregar a este install.sh se usa el shell básico Bourne (#!/bin/sh), lo que significa que algunos de los comandos que son parte del shell Bourne de Linux y que no están presentes en el shell Bourne de Solaris simplemente no funcionan.

source: Notably the -e (exists) switch is not present in the Solaris Bourne shell:
es_ve: Cabe destacar que el interruptor e-(existe) no está presente en el shell Bourne de Solaris:

source: In order to solve this do the following:
es_ve: Para resolver esto haga lo siguiente:

source: The locations of all dependencies need to be located on Solaris:
es_ve: Se necesita que las locaciones de todas las dependencias se ubiquen en Solaris:

source: (a) gcc - /usr/local/bin/gcc (gcc-3.4.6 installed from www.sunfreeware.com - default on solaris 10 is /opt/sfw/bin/gcc)
es_ve: (a) gcc - /usr/local/bin/gcc (gcc-3.4.6 proveniente de www.sunfreeware.com - por defecto en solaris 10 es /opt/sfw/bin/gcc)

source: (b) g++ - /usr/local/bin/g++ (Installed with gcc-3.4.6 - default on solaris 10 = /opt/sfw/bin/g++)
es_ve: (b) g++ - /usr/local/bin/g++ (Instalado con gcc-3.4.6 - por defecto en solaris 10 = /opt/sfw/bin/g++)

source: In addition install.sh uses the "whoami" shell command, which on Solaris is in:
es_ve: Además install.sh usa el comando shell "whoami" , el cual en Solaris se encuentra en:

source: Ensure the above PATHs are all in the system path:
es_ve: Garantice que todas las Rutas anteriores se encuentren en la ruta del sistema:

source: (If /usr/ccs/bin is not added, the Python compile will fail with "gmake: ar: Command not found".)
es_ve: (Si /usr/ccs/bin no es agregado, la compilación de Python fallará con "gmake: ar: Command not found".)

source: As the -e switch is not present in the Solaris Bourne shell, install.sh and all other scripts must be changed to bash: #!/usr/bin/bash
es_ve: Debido a que el interruptor -e no está presente en el shell Bourne de Solaris, install.sh, y todos los otros scripts, este se debe cambiar a bash: #!/usr/bin/bash

source: install.sh uses the "which" shell command to locate the software it needs for the build.
es_ve: install.sh utiliza el comando shell "which" para localizar el software que necesita para la construcción.

source: To ensure the correct versions of the software were used (rather than any Solaris defaults), install.sh was modified to explicitly set the location of each piece of software:
es_ve: Para garantizar que las versiones correctas del software fueron utilizadas (en lugar de las predeterminadas de Solaris), install.sh fue modificado explicitamente para definir las locaciones de cada pieza del software:

source: During the Python build, both the "libssl" and "readline" libraries are needed.
es_ve: Durante la construcción se necesitan ambas librerías: "libssl" y "readline".

source: Add them to the system library path:
es_ve: Agréguelas a la ruta de la librería del sistema.

source: For more info see:
es_ve: Para más información:

source: Posted by Coopertino at Sep 09, 2008 02:03 PM
es_ve: Publicado por Coopertino el 9 de Septiembre de 2008 02:03 PM

source: The install went smoothly, after the following 2 mods :
es_ve: La instalación se ejecutó sin problemas, después de estas dos modificaciones:

source: intall.sh line 1
es_ve: intall.sh línea 1

source: install.sh line 81
es_ve: install.sh línea 81

source: Installing on Windows
es_ve: Instalando en Windows

source: How to get Plone up and running on Windows, not for serious development
es_ve: ¿Cómo preparar y ejecutar Plone en Windows?; no para desarrollo considerable.

source: The binary installer for Windows is the option to choose if you want to try out Plone on Windows or host a site but not serious development.
es_ve: El instalador binario para Windows es la opción a escoger si quiere probar Plone en Windows o para ser el host de un sitio, pero no para desarrollo considerable.

source: Should you want to do serious development, check this document.
es_ve: Si quiere elaborar un desarrollo considerable, revise este documento.

source: Otherwise, continue reading these instructions, taken from the Catapult Solutions site.
es_ve: De lo contrario, continué leyendo estas instrucciones tomadas del sitio Catapult Solutions.

source: Downloading and Installing Plone
es_ve: Descargue e instale Plone

source: Download the installer from this page on plone.org: http://plone.org/products/plone.
es_ve: Descargue el instalador de esta página contenida en plone.org: http://plone.org/products/plone.

source: Save it in a place you can remember, such as your desktop.
es_ve: Guárdelo en un sitio que pueda recordar, tal como su Escritorio.

source: After the download is completed, double-click on the installer file to run it.
es_ve: Después que la descarga haya finalizado, haga doble clic en archivo del instalador para ejecutarlo.

source: Go through the installation wizard.
es_ve: Encamínese por el asistente de instalación.

source: Never install Plone in the same folder of a previous installation, always use a new one.
es_ve: Nunca instale Plone en la misma carpeta que usó para instalar una versión vieja, siempre use una nueva.

source: Write down the installation location, such as "C:\Program Files\Plone".
es_ve: Escriba o copie la locación de la instalación, tal como esta "C:\Program Files\Plone".

source: You'll need this later.
es_ve: Usted necesitará esto más adelante.

source: Write down the Username and Password you enter in the wizard.
es_ve: Escriba el nombre de usuario y contraseña que ingrese en el asistente.

source: You'll need this later too.
es_ve: Ya que también necesitará esto después.

source: Wait while the installer Extracts files and sets up your Plone instance.
es_ve: Aguarde mientras el instalador Extrae los archivos y crea la instancia de Plone.

source: Starting/stopping Plone
es_ve: Iniciando/Deteniendo Plone

source: Using the Controller
es_ve: Usando el Controlador

source: You can access the Plone Windows Controller from the Start button â Programs â Plone.
es_ve: Usted puede acceder al Controlador de Plone para Windows, mediante el botón de Inicio > Todos los programas > Plone.

source: You can use the controller to start/stop the Plone server (Zope) and check its status.
es_ve: Con el controlador puede start/stop (iniciar/detener) el servidor (Zope) de Plone y revisar el estado.

source: Using the command line
es_ve: Usando la línea de comando.

source: After the installer is finished, open a Command Prompt window (usually in Start > All Programs > Accessories).
es_ve: Después de que el instalador haya finalizado proceda a abrir una ventana de Símbolo de sistema (generalmente Inicio > Todos los programas > Accesorios).

source: Move into your Plone installation directory, which you wrote down earlier.
es_ve: Vaya al directorio de instalación de Plone, aquel que escribió anteriormente.

source: Example: cd "\Program Files\Plone".
es_ve: Ejemplo: cd "\Program Files\Plone".

source: To start your Plone instance for the first time, issue this command: "bin\instance.exe fg".
es_ve: Para iniciar la instancia de Plone por primera vez, introduzca el siguiente comando: "bin\instance.exe fg".

source: This will start Plone in debug mode.
es_ve: Esto iniciará Plone en modo de depuración.

source: It will display the port number that Plone is running on, which is 8080 by default.
es_ve: A su vez mostrará el número de puerto por el cual Plone se está ejecutando; por defecto es el puerto 8080.

source: You will know your Plone instance has finished starting and is ready when you see the message "INFO Zope Ready to handle requests" in the terminal.
es_ve: Usted sabrá que la instancia de Plone ha terminado la iniciación y está listo cuando se muestre el siguiente mensaje en la terminal "INFO Zope Ready to handle requests" (Información Zope preparado para manejar solicitudes).

source: To stop Plone, just use a CTRL-C in you Command Prompt window.
es_ve: Para detener Plone, simplemente use CTRL-C en su ventana de Símbolo de sistema.

source: Starting Plone as a service
es_ve: Iniciar Plone como un servicio

source: If you'd like Plone to start as a service when you start your computer you'll need to CD into your Plone install directory, then issue the following command in your Command Prompt window: "bin\instance install".
es_ve: Si quisiera que Plone se inicie como un servicio al momento de iniciar su computadora necesitará efectuar un CD al directorio de su instalación, luego ingrese el siguiente comando en la ventana de Símbolo de sistema: "bin\instance install".

source: This will install a new service that will show up in your Services Management Console.
es_ve: Esta acción instalará un nuevo servicio que a su vez se mostrará en la Consola de Administración de Servicios.

source: It will be listed as: "Zope instance at C:\Program Files\Plone\parts\instance.exe" if you installed to "C:\Program Files\Plone".
es_ve: Estará listada como: "Zope instance at C:\Program Files\Plone\parts\instance.exe", por supuesto si hizo la instalación en "C:\Program Files\Plone".

source: After the service is installed you can start Plone immediately by issuing the following command in your Command Prompt window: "bin\instance.exe start", or use the Plone Controller (see above).
es_ve: Luego de que el servicio ha sido instalado inmediatamente puede iniciar Plone escribiendo el siguiente comando en su venta de Símbolo de sistema: "bin\instance.exe start", o utilice el Controlador de Plone (visto anteriormente).

source: If you'd like to remove the service later, just CD into your Plone install directory, then issue this command in your Command Prompt window: "bin\instance.exe remove".
es_ve: En el caso de que quiera remover este servicio, use el comando CD al directorio de su instalación y luego ingrese lo siguiente: "bin\instance.exe remove".

source: Accessing Plone
es_ve: Accediendo a Plone

source: You may need to tell your firewall to open TCP Port 8080 before you can access Plone's web interface.
es_ve: Quizás tenga que transmitirle a su Firewall (cortafuegos) que abra el puerto 8080, antes de que pueda acceder a la interfaz web de Plone.

source: Open a browser window and browse to http://localhost:8080/.
es_ve: Abra un navegador web y vaya a http://localhost:8080/.

source: Click on the button with the text "Create a new Plone site" on it.
es_ve: Haga clic en el botón que contiene el texto "Create a new Plone site" (Crear un nuevo sitio Plone)

source: You'll be asked for the username and password that you wrote down earlier.
es_ve: Se le pedirá que introduzca el nombre de usuario y contraseña: aquellos que escribió anteriormente.

source: Give your site an Id, like "Plone", and a Title, like "My Plone Site".
es_ve: Otórguele a su sitio una identificación como "Plone", y un título como "Mi sitio Plone".

source: You can also select the site language and some additional products for installing.
es_ve: Además puede seleccionar el idioma del sitio y algunos productos adicionales para su instalación.

source: Then click on the "Add Plone Site" button near the bottom of the page.
es_ve: Luego haga clic en el botón "Add Plone Site" (Agregar nuevo sitio Plone) cerca del final de la página.

source: It will take a few seconds to create your Plone site
es_ve: Tomará unos segundos crear su sitio Plone

source: After your site is created you can access it with this URL: http://localhost:8080/Plone, where "Plone" is the Id you gave to your site.
es_ve: Después de que su sitio se haya creado puede acceder a él mediante esta URL: http://localhost:8080/Plone, donde "Plone" es la identificación de su sitio.
